# 제어문
'''
코드의 흐름을 제어하는 문법
프로그램은 어떠한 작업을 하기위해 단순하게 순차적, 어떤 조건에 의한 분기, 특정 코드 부분을 반복해서 실행한다. 여기서 주어진 조건에 따라 반복해서 코드를 실행할때 사용하는 것을 제어문이라고 한다.
'''
# 조건문 ( Condition )
# 특정한 조건을 만족하면 ( True ) 코드를 실행

# 조건문의 구조

# 중첩 조건문

# 반복문(Loop)

# while 문
'''
조건제 반복
조건이 참인 동안 반복
무한 반복 주의
'''

# 중첩 while 문

# for 문
'''
반복 가능(iterable)한 객체를 더이상 꺼낼수 없을때 까지 반복
list, tuple, set, dict , str
'''

# 파이썬의 range 함수
'''
특정 구간의 숫자의 범위를 만들어주는 함수
슬라이싱 기법을 이용하여 숫자의 범위를 만들수 있다.
파이썬에 range 라는 숫자의 범위를 가진 iterable한 특수한 객체이다.
for문과 같이 자주 사용된다.
'''

# 중첩 for 문

# break 문
# 해당 반복문을 빠져 나온다.

# continue 문
# 진행을 중단하고 다음 반복으로 넘어간다.

# enumerate 함수
# iterable한 객체를 꺼낼때 인덱스도 같이 꺼낸다.

# zip 함수
# 여러 개의 컬렉션을 순번대로 병렬로 꺼낸다.

# dict를 for 문으로 반복

# 삼항 연산자
# if, else만 사용해서 삼항연산을 수행

# 컴프리헨션(Comprehension)
'''
반복가능한 객체를 활용해서 새로운 반복가능한 객체를 만들때 유용하다.
list, set, dict를 자료형을 간단하게 만들기 위한 문법
tuple 은 컴프리헨션으로 만들 수 없다
'''

# dict Comprehension